package TextFormater;

public class Main {
    public static void main(String[] args) {
        TextFormater str = new TextFormater("По мнению мадам, в любой отрасли перспективной является роботизация складского, логистического хозяйства, так как в этой области есть абоба отработанные унифицированные приемы, которые подходят практически для всех предприятий. А что касается непосредственно легкой промышленности, здесь нужно точечно смотреть, где можно заменить полуавтоматический или ручной труд роботизированными комплексами. Например, на Добрушском фарфоровом заводе есть ручная подача посуды и снятие ее с конвейера. На мой взглд такие опеии долны выься автки. Кроме того, думаю, что необходимы и роботизированные комплексы по пошиву футболок, постельного белья, полотенец.");
        str.wordsNumber();
    }
}
